In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("../data/HR_RAW_DATA.csv",index_col=0)
df

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber,...,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,"162,0",...,20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,"259,0",...,33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,"319,0",...,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,NaN,...,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,NaN,...,19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1609,36,Yes,travel_rarely,"530,0$",NaN,3,1,Life Sciences,1,"967,0",...,16,NaN,3,7,"10325,0",1987,1000000000$,NaN,NaN,0
1610,45,No,non-travel,"805,0$",NaN,4,2,NaN,1,"972,0",...,9,NaN,0,8,"4447,0",1978,1000000000$,NaN,NaN,1
1611,39,No,travel_rarely,"903,0$",NaN,-13,5,NaN,1,NaN,...,8,NaN,0,7,NaN,1984,1000000000$,NaN,NaN,Yes
1612,36,No,non-travel,"1229,0$",NaN,8,4,Technical Degree,1,"990,0",...,7,NaN,0,7,NaN,1987,1000000000$,NaN,NaN,True
1613,46,No,NaN,"566,0$",NaN,7,2,Medical,1,NaN,...,8,NaN,0,7,"10845,0",1977,1000000000$,NaN,NaN,0

pd.set_option('display.max_columns', None)pd.set_option('display.max_rows', None)

In [3]:
pd.set_option('display.max_columns', None)
#pd.set_option('display.max_rows', None)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1614 entries, 0 to 1613
Data columns (total 41 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       1614 non-null   object
 1   Attrition                 1614 non-null   object
 2   BusinessTravel            842 non-null    object
 3   DailyRate                 1614 non-null   object
 4   Department                302 non-null    object
 5   DistanceFromHome          1614 non-null   int64
 6   Education                 1614 non-null   int64
 7   EducationField            869 non-null    object
 8   employeecount             1614 non-null   int64
 9   employeenumber            1183 non-null   object
 10  EnvironmentSatisfaction   1614 non-null   int64
 11  Gender                    1614 non-null   int64
 12  HourlyRate                1614 non-null   object
 13  JobInvolvement            1614 non-null   int64
 14  JobLevel                  1614 non-null   int64
 15  JobRole                   1614 non-null   object
 16  JobSatisfaction           1614 non-null   int64
 17  MaritalStatus             963 non-null    object
 18  MonthlyIncome             771 non-null    object
 19  MonthlyRate               1614 non-null   int64
 20  NUMCOMPANIESWORKED        1614 non-null   int64
 21  Over18                    713 non-null    object
 22  OverTime                  938 non-null    object
 23  PercentSalaryHike         1614 non-null   int64
 24  PerformanceRating         1419 non-null   object
 25  RelationshipSatisfaction  1614 non-null   int64
 26  StandardHours             419 non-null    object
 27  StockOptionLevel          1614 non-null   int64
 28  TOTALWORKINGYEARS         1088 non-null   object
 29  TrainingTimesLastYear     1614 non-null   int64
 30  WORKLIFEBALANCE           1506 non-null   object
 31  YearsAtCompany            1614 non-null   int64
 32  YearsInCurrentRole        34 non-null     object
 33  YearsSinceLastPromotion   1614 non-null   int64
 34  YEARSWITHCURRMANAGER      1614 non-null   int64
 35  SameAsMonthlyIncome       771 non-null    object
 36  DateBirth                 1614 non-null   int64
 37  Salary                    1614 non-null   object
 38  RoleDepartament           302 non-null    object
 39  NUMBERCHILDREN            0 non-null      float64
 40  RemoteWork                1614 non-null   object
dtypes: float64(1), int64(18), object(22)
memory usage: 529.6+ KB

In [5]:
df.head(10)

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NUMCOMPANIESWORKED,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TOTALWORKINGYEARS,TrainingTimesLastYear,WORKLIFEBALANCE,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,"162,0",1,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462,7,Y,No,13,"3,0",3,NaN,0,NaN,5,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,"259,0",3,0,65,2,5,ManAGeR,3,NaN,"19999,0",5678,0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,"319,0",3,0,58,3,5,ManaGER,4,Married,"19232,0",4933,1,NaN,No,11,"3,0",4,NaN,0,"22,0",3,NaN,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,NaN,1,1,82,3,4,ReseArCH DIrECtOr,3,Married,"17169,0",26703,3,Y,NaN,19,"3,0",2,NaN,2,NaN,2,NaN,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,NaN,1,1,45,4,4,sAleS EXECUtIve,1,Divorced,NaN,7739,2,Y,No,12,"3,0",4,NaN,1,NaN,5,"3,0",19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0
5,48,No,NaN,"117,0$",Research & Development,22,3,Medical,1,"1900,0",4,1,58,3,4,MANAger,4,NaN,"17174,0",2437,3,NaN,No,11,"3,0",2,NaN,1,NaN,3,"3,0",22,NaN,4,7,"17174,0",1975,1000000000$,MANAger - Research & Development,NaN,Yes
6,59,No,NaN,"1435,0$",NaN,25,3,Life Sciences,1,"81,0",1,1,99,3,3,Sales ExeCutIVe,1,NaN,NaN,2354,7,Y,NaN,11,"3,0",4,NaN,0,"28,0",3,"2,0",21,NaN,7,9,NaN,1964,1000000000$,NaN,NaN,True
7,42,No,travel_rarely,"635,0$",NaN,1,1,NaN,1,"387,0",2,0,99,3,2,Sales eXEcUTiVe,3,Married,NaN,24532,1,NaN,No,25,"4,0",3,NaN,0,"20,0",3,"3,0",20,NaN,11,6,NaN,1981,1000000000$,NaN,NaN,0
8,41,No,NaN,"1276,0$",NaN,2,5,NaN,1,NaN,2,1,91,3,4,mANAGEr,1,Married,"16595,0",5626,7,NaN,No,16,"3,0",2,NaN,1,"22,0",2,"3,0",18,NaN,11,8,"16595,0",1982,1000000000$,NaN,NaN,True
9,41,No,travel_frequently,"840,0$",NaN,9,3,NaN,1,"999,0",1,0,64,3,5,reSEaRCH DIrectoR,3,NaN,NaN,3735,2,NaN,No,17,"3,0",2,NaN,1,"21,0",2,"4,0",18,NaN,0,11,NaN,1982,1000000000$,NaN,NaN,0

In [6]:
df.describe ().T

,count,mean,std,min,25%,50%,75%,max
DistanceFromHome,1614.0,4.527261,14.591913,-49.0,2.0,5.0,11.0,29.0
Education,1614.0,2.925031,1.022357,1.0,2.0,3.0,4.0,5.0
employeecount,1614.0,1.000000,0.000000,1.0,1.0,1.0,1.0,1.0
EnvironmentSatisfaction,1614.0,4.294919,6.993559,1.0,2.0,3.0,4.0,49.0
Gender,1614.0,0.398389,0.489718,0.0,0.0,0.0,1.0,1.0
JobInvolvement,1614.0,2.739777,0.711567,1.0,2.0,3.0,3.0,4.0
JobLevel,1614.0,2.068154,1.101344,1.0,1.0,2.0,3.0,5.0
JobSatisfaction,1614.0,2.738538,1.106163,1.0,2.0,3.0,4.0,4.0
MonthlyRate,1614.0,14284.495663,7110.414585,2094.0,8001.0,14248.5,20364.0,26999.0
NUMCOMPANIESWORKED,1614.0,2.673482,2.506152,0.0,1.0,2.0,4.0,9.0
PercentSalaryHike,1614.0,15.165428,3.648610,11.0,12.0,14.0,18.0,25.0
RelationshipSatisfaction,1614.0,2.704461,1.079031,1.0,2.0,3.0,4.0,4.0
StockOptionLevel,1614.0,0.791202,0.842396,0.0,0.0,1.0,1.0,3.0
TrainingTimesLastYear,1614.0,2.809789,1.297765,0.0,2.0,3.0,3.0,6.0
YearsAtCompany,1614.0,7.132590,6.124237,0.0,3.0,5.0,9.0,40.0
YearsSinceLastPromotion,1614.0,2.245973,3.235665,0.0,0.0,1.0,3.0,15.0
YEARSWITHCURRMANAGER,1614.0,4.220570,3.562695,0.0,2.0,3.0,7.0,17.0
DateBirth,1614.0,1986.076208,9.101332,1963.0,1980.0,1987.0,1993.0,2005.0
NUMBERCHILDREN,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [7]:
df.describe (include="object").T   #

                    count unique                       top  freq
Age                  1614     54                        35    84
Attrition            1614      2                        No  1355
BusinessTravel        842      3             travel_rarely   586
DailyRate            1614    849                      nan$   124
Department            302      3   Research & Development    196
EducationField        869      6             Life Sciences   349
employeenumber       1183   1079                     482,0     2
HourlyRate           1614     72             Not Available    84
JobRole              1614   1579                  mANager      4
MaritalStatus         963      5                   Married   404
MonthlyIncome         771    668                    6347,0     4
Over18                713      1                         Y   713
OverTime              938      2                        No   682
PerformanceRating    1419      2                       3,0  1205
StandardHours         419      1                      80,0   419
TOTALWORKINGYEARS    1088     40                      10,0   144
WORKLIFEBALANCE      1506      4                       3,0   913
YearsInCurrentRole     34     10                       2,0    11
SameAsMonthlyIncome   771    668                    6347,0     4
Salary               1614      1               1000000000$  1614
RoleDepartament       302    301        MaNAgeR  -  Sales      2
RemoteWork           1614      5                         1   360

In [8]:
df.duplicated().sum()

0

In [9]:
df["Age"].value_counts() ##Hay valores no numÃ©ricos como fifty-eight. Hacer un replace de estos y cambiarlos a nÃºmeros.

35              84
34              83
31              82
29              78
36              74
32              64
38              64
30              63
33              61
40              60
27              54
37              53
28              53
42              50
45              48
41              46
26              45
39              45
43              40
46              38
44              34
50              31
25              27
24              26
47              26
49              25
55              24
54              20
51              20
53              20
48              20
52              18
56              17
21              16
22              16
23              15
58              14
20              11
59              10
19               9
18               8
60               5
57               5
thirty-two       2
fifty-eight      1
twenty-six       1
thirty-seven     1
thirty-one       1
thirty           1
fifty-two        1
fifty-five       1
thirty-six       1
forty-seven      1
twenty-four      1
Name: Age, dtype: int64

In [10]:
df['Age'] = df['Age'].replace(['fifty_five'], '55') 
df['Age'].value_counts()

35              84
34              83
31              82
29              78
36              74
32              64
38              64
30              63
33              61
40              60
27              54
37              53
28              53
42              50
45              48
41              46
26              45
39              45
43              40
46              38
44              34
50              31
25              27
24              26
47              26
49              25
55              24
54              20
51              20
53              20
48              20
52              18
56              17
21              16
22              16
23              15
58              14
20              11
59              10
19               9
18               8
60               5
57               5
thirty-two       2
fifty-eight      1
twenty-six       1
thirty-seven     1
thirty-one       1
thirty           1
fifty-two        1
fifty-five       1
thirty-six       1
forty-seven      1
twenty-four      1
Name: Age, dtype: int64

In [11]:
nuevas_columnas = {columna: columna.lower()for columna in df.columns}

df.rename (columns=nuevas_columnas, inplace= True)

df.columns

Index(['age', 'attrition', 'businesstravel', 'dailyrate', 'department',
       'distancefromhome', 'education', 'educationfield', 'employeecount',
       'employeenumber', 'environmentsatisfaction', 'gender', 'hourlyrate',
       'jobinvolvement', 'joblevel', 'jobrole', 'jobsatisfaction',
       'maritalstatus', 'monthlyincome', 'monthlyrate', 'numcompaniesworked',
       'over18', 'overtime', 'percentsalaryhike', 'performancerating',
       'relationshipsatisfaction', 'standardhours', 'stockoptionlevel',
       'totalworkingyears', 'trainingtimeslastyear', 'worklifebalance',
       'yearsatcompany', 'yearsincurrentrole', 'yearssincelastpromotion',
       'yearswithcurrmanager', 'sameasmonthlyincome', 'datebirth', 'salary',
       'roledepartament', 'numberchildren', 'remotework'],
      dtype='object')

In [12]:
# Crear un diccionario con el cambio de edades a valores numÃ©ricos
edades_cambio =  {'fifty-five': '55', 'thirty-six': '36', 'forty-seven': '47', 'twenty-four': '24', 'thirty-seven': '37', 'fifty-two': '52', 'fifty-eight': '58', 'twenty-six': '26', 'thirty-one': '31', 'thirty': '30', 'thirty-two': '32'} 


# Reemplazar las edades en la columna "Age" utilizando el diccionario
df['age'] = df['age'].replace(edades_cambio)

# Contar las ocurrencias de cada edad en la columna "Age"
conteo_edades = df['age'].value_counts()

# Imprimir el resultado
print(conteo_edades)

35    84
31    83
34    83
29    78
36    75
32    66
38    64
30    64
33    61
40    60
27    54
37    54
28    53
42    50
45    48
41    46
26    46
39    45
43    40
46    38
44    34
50    31
24    27
47    27
25    27
55    25
49    25
54    20
51    20
53    20
48    20
52    19
56    17
22    16
21    16
58    15
23    15
20    11
59    10
19     9
18     8
60     5
57     5
Name: age, dtype: int64

In [13]:
df['age']=df['age'].apply(pd.to_numeric)

In [14]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
age,1614.0,36.920694,9.102157,18.0,30.0,36.0,43.0,60.0
distancefromhome,1614.0,4.527261,14.591913,-49.0,2.0,5.0,11.0,29.0
education,1614.0,2.925031,1.022357,1.0,2.0,3.0,4.0,5.0
employeecount,1614.0,1.000000,0.000000,1.0,1.0,1.0,1.0,1.0
environmentsatisfaction,1614.0,4.294919,6.993559,1.0,2.0,3.0,4.0,49.0
gender,1614.0,0.398389,0.489718,0.0,0.0,0.0,1.0,1.0
jobinvolvement,1614.0,2.739777,0.711567,1.0,2.0,3.0,3.0,4.0
joblevel,1614.0,2.068154,1.101344,1.0,1.0,2.0,3.0,5.0
jobsatisfaction,1614.0,2.738538,1.106163,1.0,2.0,3.0,4.0,4.0
monthlyrate,1614.0,14284.495663,7110.414585,2094.0,8001.0,14248.5,20364.0,26999.0
numcompaniesworked,1614.0,2.673482,2.506152,0.0,1.0,2.0,4.0,9.0
percentsalaryhike,1614.0,15.165428,3.648610,11.0,12.0,14.0,18.0,25.0
relationshipsatisfaction,1614.0,2.704461,1.079031,1.0,2.0,3.0,4.0,4.0
stockoptionlevel,1614.0,0.791202,0.842396,0.0,0.0,1.0,1.0,3.0
trainingtimeslastyear,1614.0,2.809789,1.297765,0.0,2.0,3.0,3.0,6.0
yearsatcompany,1614.0,7.132590,6.124237,0.0,3.0,5.0,9.0,40.0
yearssincelastpromotion,1614.0,2.245973,3.235665,0.0,0.0,1.0,3.0,15.0
yearswithcurrmanager,1614.0,4.220570,3.562695,0.0,2.0,3.0,7.0,17.0
datebirth,1614.0,1986.076208,9.101332,1963.0,1980.0,1987.0,1993.0,2005.0
numberchildren,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1614 entries, 0 to 1613
Data columns (total 41 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   age                       1614 non-null   int64
 1   attrition                 1614 non-null   object
 2   businesstravel            842 non-null    object
 3   dailyrate                 1614 non-null   object
 4   department                302 non-null    object
 5   distancefromhome          1614 non-null   int64
 6   education                 1614 non-null   int64
 7   educationfield            869 non-null    object
 8   employeecount             1614 non-null   int64
 9   employeenumber            1183 non-null   object
 10  environmentsatisfaction   1614 non-null   int64
 11  gender                    1614 non-null   int64
 12  hourlyrate                1614 non-null   object
 13  jobinvolvement            1614 non-null   int64
 14  joblevel                  1614 non-null   int64
 15  jobrole                   1614 non-null   object
 16  jobsatisfaction           1614 non-null   int64
 17  maritalstatus             963 non-null    object
 18  monthlyincome             771 non-null    object
 19  monthlyrate               1614 non-null   int64
 20  numcompaniesworked        1614 non-null   int64
 21  over18                    713 non-null    object
 22  overtime                  938 non-null    object
 23  percentsalaryhike         1614 non-null   int64
 24  performancerating         1419 non-null   object
 25  relationshipsatisfaction  1614 non-null   int64
 26  standardhours             419 non-null    object
 27  stockoptionlevel          1614 non-null   int64
 28  totalworkingyears         1088 non-null   object
 29  trainingtimeslastyear     1614 non-null   int64
 30  worklifebalance           1506 non-null   object
 31  yearsatcompany            1614 non-null   int64
 32  yearsincurrentrole        34 non-null     object
 33  yearssincelastpromotion   1614 non-null   int64
 34  yearswithcurrmanager      1614 non-null   int64
 35  sameasmonthlyincome       771 non-null    object
 36  datebirth                 1614 non-null   int64
 37  salary                    1614 non-null   object
 38  roledepartament           302 non-null    object
 39  numberchildren            0 non-null      float64
 40  remotework                1614 non-null   object
dtypes: float64(1), int64(19), object(21)
memory usage: 529.6+ KB

In [16]:
df['attrition'].value_counts()

No     1355
Yes     259
Name: attrition, dtype: int64

In [17]:
df['businesstravel'].value_counts()

travel_rarely        586
travel_frequently    165
non-travel            91
Name: businesstravel, dtype: int64

In [18]:
df['businesstravel']=df['businesstravel'].str.replace("-","_")

In [19]:
df['businesstravel']=df['businesstravel'].replace(np.nan, "desconocido")

df['businesstravel']

0         desconocido
1         desconocido
2       travel_rarely
3       travel_rarely
4         desconocido
            ...
1609    travel_rarely
1610       non_travel
1611    travel_rarely
1612       non_travel
1613      desconocido
Name: businesstravel, Length: 1614, dtype: object

In [20]:
df.rename(columns={"businesstravel": "business_travel"}, inplace=True)

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1614 entries, 0 to 1613
Data columns (total 41 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   age                       1614 non-null   int64
 1   attrition                 1614 non-null   object
 2   business_travel           1614 non-null   object
 3   dailyrate                 1614 non-null   object
 4   department                302 non-null    object
 5   distancefromhome          1614 non-null   int64
 6   education                 1614 non-null   int64
 7   educationfield            869 non-null    object
 8   employeecount             1614 non-null   int64
 9   employeenumber            1183 non-null   object
 10  environmentsatisfaction   1614 non-null   int64
 11  gender                    1614 non-null   int64
 12  hourlyrate                1614 non-null   object
 13  jobinvolvement            1614 non-null   int64
 14  joblevel                  1614 non-null   int64
 15  jobrole                   1614 non-null   object
 16  jobsatisfaction           1614 non-null   int64
 17  maritalstatus             963 non-null    object
 18  monthlyincome             771 non-null    object
 19  monthlyrate               1614 non-null   int64
 20  numcompaniesworked        1614 non-null   int64
 21  over18                    713 non-null    object
 22  overtime                  938 non-null    object
 23  percentsalaryhike         1614 non-null   int64
 24  performancerating         1419 non-null   object
 25  relationshipsatisfaction  1614 non-null   int64
 26  standardhours             419 non-null    object
 27  stockoptionlevel          1614 non-null   int64
 28  totalworkingyears         1088 non-null   object
 29  trainingtimeslastyear     1614 non-null   int64
 30  worklifebalance           1506 non-null   object
 31  yearsatcompany            1614 non-null   int64
 32  yearsincurrentrole        34 non-null     object
 33  yearssincelastpromotion   1614 non-null   int64
 34  yearswithcurrmanager      1614 non-null   int64
 35  sameasmonthlyincome       771 non-null    object
 36  datebirth                 1614 non-null   int64
 37  salary                    1614 non-null   object
 38  roledepartament           302 non-null    object
 39  numberchildren            0 non-null      float64
 40  remotework                1614 non-null   object
dtypes: float64(1), int64(19), object(21)
memory usage: 529.6+ KB

In [22]:
df['dailyrate'].value_counts()

nan$      124
691,0$      7
329,0$      7
147,0$      6
530,0$      6
         ...
317,0$      1
891,0$      1
759,0$      1
483,0$      1
105,0$      1
Name: dailyrate, Length: 849, dtype: int64

In [23]:
df.rename(columns={"dailyrate": "daily_rate"}, inplace=True)
df

,age,attrition,business_travel,daily_rate,department,distancefromhome,education,educationfield,employeecount,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,over18,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,standardhours,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,roledepartament,numberchildren,remotework
0,51,No,desconocido,"684,0$",NaN,6,3,NaN,1,"162,0",1,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462,7,Y,No,13,"3,0",3,NaN,0,NaN,5,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,52,No,desconocido,"699,0$",NaN,1,4,Life Sciences,1,"259,0",3,0,65,2,5,ManAGeR,3,NaN,"19999,0",5678,0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,"319,0",3,0,58,3,5,ManaGER,4,Married,"19232,0",4933,1,NaN,No,11,"3,0",4,NaN,0,"22,0",3,NaN,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,NaN,1,1,82,3,4,ReseArCH DIrECtOr,3,Married,"17169,0",26703,3,Y,NaN,19,"3,0",2,NaN,2,NaN,2,NaN,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,46,No,desconocido,"1319,0$",NaN,3,3,Technical Degree,1,NaN,1,1,45,4,4,sAleS EXECUtIve,1,Divorced,NaN,7739,2,Y,No,12,"3,0",4,NaN,1,NaN,5,"3,0",19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1609,36,Yes,travel_rarely,"530,0$",NaN,3,1,Life Sciences,1,"967,0",3,0,51,2,3,saLEs ExeCUTiVe,4,Married,"10325,0",5518,1,Y,NaN,11,NaN,1,NaN,1,NaN,6,"3,0",16,NaN,3,7,"10325,0",1987,1000000000$,NaN,NaN,0
1610,45,No,non_travel,"805,0$",NaN,4,2,NaN,1,"972,0",3,0,57,3,2,LAboRaTOry tECHNiCIAn,2,NaN,"4447,0",23163,1,NaN,NaN,12,"3,0",2,NaN,0,NaN,5,"2,0",9,NaN,0,8,"4447,0",1978,1000000000$,NaN,NaN,1
1611,39,No,travel_rarely,"903,0$",NaN,-13,5,NaN,1,NaN,13,0,41,4,3,sAlES ExECUTivE,3,Single,NaN,2560,0,NaN,No,18,"3,0",4,NaN,0,"9,0",3,"3,0",8,NaN,0,7,NaN,1984,1000000000$,NaN,NaN,Yes
1612,36,No,non_travel,"1229,0$",NaN,8,4,Technical Degree,1,"990,0",1,0,84,3,2,SaLes ExecUtIVe,4,Divorced,NaN,25952,4,NaN,No,13,NaN,4,NaN,2,"12,0",3,"3,0",7,NaN,0,7,NaN,1987,1000000000$,NaN,NaN,True
1613,46,No,desconocido,"566,0$",NaN,7,2,Medical,1,NaN,4,0,75,3,3,mAnUfactURInG DiRECTOr,3,NaN,"10845,0",24208,6,Y,NaN,13,"3,0",2,NaN,1,NaN,3,"3,0",8,NaN,0,7,"10845,0",1977,1000000000$,NaN,NaN,0

In [24]:
df['daily_rate']=df['daily_rate'].str.replace ("$", "").str.replace (",", ".")
df['daily_rate']

/tmp/ipykernel_13149/1433077915.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['daily_rate']=df['daily_rate'].str.replace ("$", "").str.replace (",", ".")

0        684.0
1        699.0
2        532.0
3        359.0
4       1319.0
         ...
1609     530.0
1610     805.0
1611     903.0
1612    1229.0
1613     566.0
Name: daily_rate, Length: 1614, dtype: object

In [25]:
df['daily_rate'].isnull().sum()

0

In [26]:
df['daily_rate']=df['daily_rate'].replace ("nan", np.nan)
df['daily_rate']

0        684.0
1        699.0
2        532.0
3        359.0
4       1319.0
         ...
1609     530.0
1610     805.0
1611     903.0
1612    1229.0
1613     566.0
Name: daily_rate, Length: 1614, dtype: object

In [27]:
df['daily_rate'].isnull().sum()

124

In [28]:
df['daily_rate']=df['daily_rate'].apply(pd.to_numeric)
df['daily_rate']

0        684.0
1        699.0
2        532.0
3        359.0
4       1319.0
         ...
1609     530.0
1610     805.0
1611     903.0
1612    1229.0
1613     566.0
Name: daily_rate, Length: 1614, dtype: float64

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1614 entries, 0 to 1613
Data columns (total 41 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   age                       1614 non-null   int64
 1   attrition                 1614 non-null   object
 2   business_travel           1614 non-null   object
 3   daily_rate                1490 non-null   float64
 4   department                302 non-null    object
 5   distancefromhome          1614 non-null   int64
 6   education                 1614 non-null   int64
 7   educationfield            869 non-null    object
 8   employeecount             1614 non-null   int64
 9   employeenumber            1183 non-null   object
 10  environmentsatisfaction   1614 non-null   int64
 11  gender                    1614 non-null   int64
 12  hourlyrate                1614 non-null   object
 13  jobinvolvement            1614 non-null   int64
 14  joblevel                  1614 non-null   int64
 15  jobrole                   1614 non-null   object
 16  jobsatisfaction           1614 non-null   int64
 17  maritalstatus             963 non-null    object
 18  monthlyincome             771 non-null    object
 19  monthlyrate               1614 non-null   int64
 20  numcompaniesworked        1614 non-null   int64
 21  over18                    713 non-null    object
 22  overtime                  938 non-null    object
 23  percentsalaryhike         1614 non-null   int64
 24  performancerating         1419 non-null   object
 25  relationshipsatisfaction  1614 non-null   int64
 26  standardhours             419 non-null    object
 27  stockoptionlevel          1614 non-null   int64
 28  totalworkingyears         1088 non-null   object
 29  trainingtimeslastyear     1614 non-null   int64
 30  worklifebalance           1506 non-null   object
 31  yearsatcompany            1614 non-null   int64
 32  yearsincurrentrole        34 non-null     object
 33  yearssincelastpromotion   1614 non-null   int64
 34  yearswithcurrmanager      1614 non-null   int64
 35  sameasmonthlyincome       771 non-null    object
 36  datebirth                 1614 non-null   int64
 37  salary                    1614 non-null   object
 38  roledepartament           302 non-null    object
 39  numberchildren            0 non-null      float64
 40  remotework                1614 non-null   object
dtypes: float64(2), int64(19), object(20)
memory usage: 529.6+ KB

In [30]:
df['department'].value_counts()

 Research & Development     196
 Sales                       91
 Human Resources             15
Name: department, dtype: int64

In [31]:
df['department']=df['department'].str.lower().str.replace("research & development","research_development").str.replace("human resources", "human_resources")

df['department'].value_counts()

 research_development     196
 sales                     91
 human_resources           15
Name: department, dtype: int64

In [32]:
df['department']=df['department'].replace (np.nan, "desconocido")

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1614 entries, 0 to 1613
Data columns (total 41 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   age                       1614 non-null   int64
 1   attrition                 1614 non-null   object
 2   business_travel           1614 non-null   object
 3   daily_rate                1490 non-null   float64
 4   department                1614 non-null   object
 5   distancefromhome          1614 non-null   int64
 6   education                 1614 non-null   int64
 7   educationfield            869 non-null    object
 8   employeecount             1614 non-null   int64
 9   employeenumber            1183 non-null   object
 10  environmentsatisfaction   1614 non-null   int64
 11  gender                    1614 non-null   int64
 12  hourlyrate                1614 non-null   object
 13  jobinvolvement            1614 non-null   int64
 14  joblevel                  1614 non-null   int64
 15  jobrole                   1614 non-null   object
 16  jobsatisfaction           1614 non-null   int64
 17  maritalstatus             963 non-null    object
 18  monthlyincome             771 non-null    object
 19  monthlyrate               1614 non-null   int64
 20  numcompaniesworked        1614 non-null   int64
 21  over18                    713 non-null    object
 22  overtime                  938 non-null    object
 23  percentsalaryhike         1614 non-null   int64
 24  performancerating         1419 non-null   object
 25  relationshipsatisfaction  1614 non-null   int64
 26  standardhours             419 non-null    object
 27  stockoptionlevel          1614 non-null   int64
 28  totalworkingyears         1088 non-null   object
 29  trainingtimeslastyear     1614 non-null   int64
 30  worklifebalance           1506 non-null   object
 31  yearsatcompany            1614 non-null   int64
 32  yearsincurrentrole        34 non-null     object
 33  yearssincelastpromotion   1614 non-null   int64
 34  yearswithcurrmanager      1614 non-null   int64
 35  sameasmonthlyincome       771 non-null    object
 36  datebirth                 1614 non-null   int64
 37  salary                    1614 non-null   object
 38  roledepartament           302 non-null    object
 39  numberchildren            0 non-null      float64
 40  remotework                1614 non-null   object
dtypes: float64(2), int64(19), object(20)
memory usage: 529.6+ KB

In [34]:
df.rename (columns={"distancefromhome": "distance_from_home", 
                    "educationfield": "education_field", 
                    "employeecount": "employee_count",
                    "employeenumber": "employee_number",
                    "environmentsatisfaction": "environment_satisfaction",
                    "hourlyrate": "hourly_rate", 
                    "jobinvolvement": "job_involvement",
                    "joblevel": "job_level",
                    "jobrole": "job_role",
                    "jobsatisfaction": "job_satisfaction",
                    "maritalstatus": "marital_status",
                    "monthlyincome": "monthly_income",
                    "monthlyrate": " monthly_rate",
                    "numcompaniesworked": "num_companies_worked",
                    "over18": "over_18",
                    "percentsalaryhike": "percent_salary_hike",
                    "performancerating": "performance_rating",
                    "relationshipsatisfaction": "relationship_satisfaction",
                    "standardhours": "standard_hours",
                    "stockoptionlevel": "stock_option_level",
                    "totalworkingyears": "total_working_years",
                    "trainingtimeslastyear": "training_times_last_year",
                    "worklifebalance": "work_life_balance",
                    "yearsatcompany": "years_at_company",
                    "yearsincurrentrole": "years_in_current_role",
                    "yearssincelastpromotion": "years_since_last_promotion",
                    "yearswithcurrmanager": "years_with_curr_manager",
                    "sameasmonthlyincome": "same_as_monthly_income",
                    "datebirth": "date_birth",
                    "roledepartament": "role_departament",
                    "numberchildren": "number_children",
                    "remotework": "remote_work"}, inplace= True)

In [38]:
df["distance_from_home"].value_counts()
pd.set_option('display.max_rows', 70)

In [46]:
df["distance_from_home"].value_counts()

2     217
1     203
10     91
9      85
8      81
7      80
3      79
5      62
6      61
4      61
24     35
16     35
12     32
11     31
13     30
15     30
25     30
18     30
29     29
23     29
26     28
14     27
19     22
20     22
17     22
22     21
21     21
28     19
27     17
47      7
38      7
35      7
31      6
42      6
36      6
48      5
46      5
45      5
41      4
32      4
37      4
30      4
33      3
44      3
34      2
49      2
43      2
39      1
40      1
Name: distance_from_home, dtype: int64

In [42]:
def positive(numero):
    if numero <0:
        return -numero
    else:
        return numero

In [43]:
df["distance_from_home"]= df["distance_from_home"].apply(positive)

In [45]:
df.head()

,age,attrition,business_travel,daily_rate,department,distance_from_home,education,education_field,employee_count,employee_number,environment_satisfaction,gender,hourly_rate,job_involvement,job_level,job_role,job_satisfaction,marital_status,monthly_income,monthly_rate,num_companies_worked,over_18,overtime,percent_salary_hike,performance_rating,relationship_satisfaction,standard_hours,stock_option_level,total_working_years,training_times_last_year,work_life_balance,years_at_company,years_in_current_role,years_since_last_promotion,years_with_curr_manager,same_as_monthly_income,date_birth,salary,role_departament,number_children,remote_work
0,51,No,desconocido,684.0,desconocido,6,3,NaN,1,"162,0",1,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462,7,Y,No,13,"3,0",3,NaN,0,NaN,5,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,52,No,desconocido,699.0,desconocido,1,4,Life Sciences,1,"259,0",3,0,65,2,5,ManAGeR,3,NaN,"19999,0",5678,0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,42,No,travel_rarely,532.0,research_development,4,2,Technical Degree,1,"319,0",3,0,58,3,5,ManaGER,4,Married,"19232,0",4933,1,NaN,No,11,"3,0",4,NaN,0,"22,0",3,NaN,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,359.0,desconocido,2,4,Medical,1,NaN,1,1,82,3,4,ReseArCH DIrECtOr,3,Married,"17169,0",26703,3,Y,NaN,19,"3,0",2,NaN,2,NaN,2,NaN,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,46,No,desconocido,1319.0,desconocido,3,3,Technical Degree,1,NaN,1,1,45,4,4,sAleS EXECUtIve,1,Divorced,NaN,7739,2,Y,No,12,"3,0",4,NaN,1,NaN,5,"3,0",19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0

In [48]:
df["distance_from_home"].describe()

count    1614.000000
mean       11.141884
std        10.450560
min         1.000000
25%         2.000000
50%         8.000000
75%        17.000000
max        49.000000
Name: distance_from_home, dtype: float64

In [60]:
df[["education", "education_field" ]]
pd.set_option('display.max_rows', 100)

In [61]:
df[["education", "education_field" ]]

      education   education_field
0             3               NaN
1             4     Life Sciences
2             2  Technical Degree
3             4           Medical
4             3  Technical Degree
...         ...               ...
1609          1     Life Sciences
1610          2               NaN
1611          5               NaN
1612          4  Technical Degree
1613          2           Medical

[1614 rows x 2 columns]

In [62]:
df["education"].describe()

count    1614.000000
mean        2.925031
std         1.022357
min         1.000000
25%         2.000000
50%         3.000000
75%         4.000000
max         5.000000
Name: education, dtype: float64

In [63]:
df["education"].value_counts()

3    621
4    445
2    314
1    180
5     54
Name: education, dtype: int64

In [64]:
df["education_field"].value_counts()

Life Sciences       349
Medical             276
Marketing           104
Technical Degree     69
Other                59
Human Resources      12
Name: education_field, dtype: int64

In [65]:
df["education_field"]=df["education_field"].replace(np.nan, "desconocido")

df["education_field"]

0            desconocido
1          Life Sciences
2       Technical Degree
3                Medical
4       Technical Degree
              ...
1609       Life Sciences
1610         desconocido
1611         desconocido
1612    Technical Degree
1613             Medical
Name: education_field, Length: 1614, dtype: object

In [ ]:
df["education_field"]=df["education_field"].str.lower().str.replace("research & development","research_development").str.replace("human resources", "human_resources")

df["education_field"].value_counts()

In [66]:
dict_education= {"Life Sciences":"life_sciences",
                 "Medical"  :"medical",
                 "Marketing": "marketing",
                 "Technical Degree" : "technical_degree",
                 "Other": "other",
                 "Human Resources": "human_resources",
                 "desconocido": "desconocido"}

In [67]:
df["education_field"]=df["education_field"].map (dict_education)
df["education_field"]

0            desconocido
1          life_sciences
2       technical_degree
3                medical
4       technical_degree
              ...
1609       life_sciences
1610         desconocido
1611         desconocido
1612    technical_degree
1613             medical
Name: education_field, Length: 1614, dtype: object

In [68]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1614 entries, 0 to 1613
Data columns (total 41 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   age                         1614 non-null   int64
 1   attrition                   1614 non-null   object
 2   business_travel             1614 non-null   object
 3   daily_rate                  1490 non-null   float64
 4   department                  1614 non-null   object
 5   distance_from_home          1614 non-null   int64
 6   education                   1614 non-null   int64
 7   education_field             1614 non-null   object
 8   employee_count              1614 non-null   int64
 9   employee_number             1183 non-null   object
 10  environment_satisfaction    1614 non-null   int64
 11  gender                      1614 non-null   int64
 12  hourly_rate                 1614 non-null   object
 13  job_involvement             1614 non-null   int64
 14  job_level                   1614 non-null   int64
 15  job_role                    1614 non-null   object
 16  job_satisfaction            1614 non-null   int64
 17  marital_status              963 non-null    object
 18  monthly_income              771 non-null    object
 19   monthly_rate               1614 non-null   int64
 20  num_companies_worked        1614 non-null   int64
 21  over_18                     713 non-null    object
 22  overtime                    938 non-null    object
 23  percent_salary_hike         1614 non-null   int64
 24  performance_rating          1419 non-null   object
 25  relationship_satisfaction   1614 non-null   int64
 26  standard_hours              419 non-null    object
 27  stock_option_level          1614 non-null   int64
 28  total_working_years         1088 non-null   object
 29  training_times_last_year    1614 non-null   int64
 30  work_life_balance           1506 non-null   object
 31  years_at_company            1614 non-null   int64
 32  years_in_current_role       34 non-null     object
 33  years_since_last_promotion  1614 non-null   int64
 34  years_with_curr_manager     1614 non-null   int64
 35  same_as_monthly_income      771 non-null    object
 36  date_birth                  1614 non-null   int64
 37  salary                      1614 non-null   object
 38  role_departament            302 non-null    object
 39  number_children             0 non-null      float64
 40  remote_work                 1614 non-null   object
dtypes: float64(2), int64(19), object(20)
memory usage: 529.6+ KB

In [70]:
df.drop("employee_count", axis=1, inplace= True)

In [71]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1614 entries, 0 to 1613
Data columns (total 40 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   age                         1614 non-null   int64
 1   attrition                   1614 non-null   object
 2   business_travel             1614 non-null   object
 3   daily_rate                  1490 non-null   float64
 4   department                  1614 non-null   object
 5   distance_from_home          1614 non-null   int64
 6   education                   1614 non-null   int64
 7   education_field             1614 non-null   object
 8   employee_number             1183 non-null   object
 9   environment_satisfaction    1614 non-null   int64
 10  gender                      1614 non-null   int64
 11  hourly_rate                 1614 non-null   object
 12  job_involvement             1614 non-null   int64
 13  job_level                   1614 non-null   int64
 14  job_role                    1614 non-null   object
 15  job_satisfaction            1614 non-null   int64
 16  marital_status              963 non-null    object
 17  monthly_income              771 non-null    object
 18   monthly_rate               1614 non-null   int64
 19  num_companies_worked        1614 non-null   int64
 20  over_18                     713 non-null    object
 21  overtime                    938 non-null    object
 22  percent_salary_hike         1614 non-null   int64
 23  performance_rating          1419 non-null   object
 24  relationship_satisfaction   1614 non-null   int64
 25  standard_hours              419 non-null    object
 26  stock_option_level          1614 non-null   int64
 27  total_working_years         1088 non-null   object
 28  training_times_last_year    1614 non-null   int64
 29  work_life_balance           1506 non-null   object
 30  years_at_company            1614 non-null   int64
 31  years_in_current_role       34 non-null     object
 32  years_since_last_promotion  1614 non-null   int64
 33  years_with_curr_manager     1614 non-null   int64
 34  same_as_monthly_income      771 non-null    object
 35  date_birth                  1614 non-null   int64
 36  salary                      1614 non-null   object
 37  role_departament            302 non-null    object
 38  number_children             0 non-null      float64
 39  remote_work                 1614 non-null   object
dtypes: float64(2), int64(18), object(20)
memory usage: 517.0+ KB

In [82]:

pd.set_option('display.max_rows', None)
df["employee_number"].value_counts()

482,0     2
530,0     2
507,0     2
517,0     2
522,0     2
523,0     2
525,0     2
526,0     2
544,0     2
501,0     2
725,0     2
724,0     2
722,0     2
721,0     2
717,0     2
710,0     2
502,0     2
495,0     2
747,0     2
440,0     2
734,0     2
733,0     2
728,0     2
423,0     2
424,0     2
433,0     2
447,0     2
1140,0    2
455,0     2
460,0     2
465,0     2
470,0     2
475,0     2
478,0     2
682,0     2
663,0     2
653,0     2
1069,0    2
389,0     2
388,0     2
381,0     2
376,0     2
1044,0    2
1053,0    2
1195,0    2
621,0     2
1185,0    2
1162,0    2
1161,0    2
1160,0    2
1157,0    2
1131,0    2
401,0     2
416,0     2
430,0     2
438,0     2
446,0     2
448,0     2
454,0     2
458,0     2
476,0     2
483,0     2
488,0     2
500,0     2
534,0     2
586,0     2
595,0     2
608,0     2
616,0     2
742,0     2
1135,0    2
762,0     2
1849,0    2
972,0     2
990,0     2
1927,0    2
1911,0    2
1898,0    2
1869,0    2
1821,0    2
966,0     2
1816,0    2
1804,0    2
1797,0    2
783,0     2
1947,0    2
1954,0    2
967,0     2
1778,0    2
956,0     2
569,0     2
374,0     2
927,0     2
913,0     2
842,0     2
823,0     2
809,0     2
1541,0    2
803,0     2
524,0     2
941,0     2
793,0     2
789,0     2
307,0     2
1396,0    1
1392,0    1
1403,0    1
1380,0    1
1371,0    1
1361,0    1
1358,0    1
1405,0    1
1411,0    1
1412,0    1
1415,0    1
1389,0    1
1333,0    1
1436,0    1
1674,0    1
1721,0    1
1702,0    1
1694,0    1
1683,0    1
1682,0    1
1217,0    1
1234,0    1
1286,0    1
1670,0    1
1331,0    1
1662,0    1
1291,0    1
1301,0    1
1303,0    1
1308,0    1
1311,0    1
1317,0    1
1329,0    1
1428,0    1
1467,0    1
1439,0    1
1441,0    1
1587,0    1
1583,0    1
1580,0    1
1576,0    1
1573,0    1
1568,0    1
1560,0    1
1552,0    1
1537,0    1
1516,0    1
1513,0    1
1509,0    1
1507,0    1
1486,0    1
1475,0    1
1592,0    1
1594,0    1
1597,0    1
1655,0    1
1448,0    1
1464,0    1
1466,0    1
1471,0    1
1473,0    1
1657,0    1
1651,0    1
1607,0    1
1648,0    1
1647,0    1
1645,0    1
1644,0    1
1641,0    1
1623,0    1
162,0     1
1022,0    1
1114,0    1
246,0     1
288,0     1
287,0     1
269,0     1
250,0     1
249,0     1
247,0     1
245,0     1
178,0     1
241,0     1
233,0     1
221,0     1
218,0     1
197,0     1
193,0     1
297,0     1
303,0     1
305,0     1
316,0     1
332,0     1
337,0     1
338,0     1
341,0     1
347,0     1
349,0     1
350,0     1
362,0     1
379,0     1
380,0     1
393,0     1
394,0     1
396,0     1
179,0     1
175,0     1
555,0     1
7,0       1
26,0      1
24,0      1
21,0      1
19,0      1
18,0      1
16,0      1
2068,0    1
171,0     1
2053,0    1
2052,0    1
2046,0    1
2044,0    1
2018,0    1
1999,0    1
31,0      1
33,0      1
38,0      1
40,0      1
47,0      1
49,0      1
65,0      1
72,0      1
88,0      1
102,0     1
103,0     1
110,0     1
116,0     1
128,0     1
132,0     1
133,0     1
143,0     1
403,0     1
564,0     1
1108,0    1
896,0     1
939,0     1
930,0     1
925,0     1
922,0     1
916,0     1
902,0     1
893,0     1
847,0     1
888,0     1
885,0     1
881,0     1
874,0     1
872,0     1
859,0     1
975,0     1
991,0     1
995,0     1
1001,0    1
1010,0    1
1017,0    1
1733,0    1
1027,0    1
1028,0    1
1037,0    1
1077,0    1
1084,0    1
1094,0    1
1096,0    1
1099,0    1
1102,0    1
1103,0    1
852,0     1
838,0     1
580,0     1
652,0     1
675,0     1
671,0     1
666,0     1
665,0     1
664,0     1
659,0     1
632,0     1
819,0     1
631,0     1
624,0     1
611,0     1
593,0     1
591,0     1
585,0     1
686,0     1
699,0     1
705,0     1
707,0     1
712,0     1
732,0     1
738,0     1
744,0     1
746,0     1
752,0     1
754,0     1
769,0     1
792,0     1
797,0     1
800,0     1
806,0     1
813,0     1
1722,0    1
1996,0    1
1735,0    1
1260,0    1
945,0     1
951,0     1
952,0     1
954,0     1
959,0     1
986,0     1
994,0     1
1003,0    1
1012,0    1
1029,0    1
1033,0    1
1052,0    1
1056,0    1
1076,0    1
1079,0    1
1081,0    1
1105,0    1
1111,0    1
1113,0    1
1115,0    1
1125,0    1
1156,0    1
1158,0    1
1172,0    1
1190,0    1
1206,0    1
1210,0    1
1242,0    1
1256,0    1
940,0     1
934,0     1
923,0     1
704,0     1
566,0     1
568,0     1
614,0     1
615,0     1
622,0     1
643,0     1
648,0     1
656,0     1
657,0     1
661,0     1
662,0     1
690,0     1
701,0     1
715,0     1
918,0     1
743,0     1
749,0     1
773,0     1
775,0     1
811,0     1
812,0     1
816,0     1
832,0     1
833,0     1
834,0     1
897,0     1
904,0     1
911,0     1
1258,0    1
1263,0    1
1746,0    1
1269,0    1
1744,0    1
1755,0    1
1758,0    1
1761,0    1
1763,0    1
1766,0    1
1783,0    1
1839,0    1
1842,0    1
1847,0    1
1853,0    1
1860,0    1
1865,0    1
1875,0    1
1876,0    1
1893,0    1
1903,0    1
1928,0    1
1933,0    1
1935,0    1
1936,0    1
1938,0    1
1943,0    1
1944,0    1
1961,0    1
1966,0    1
1974,0    1
2012,0    1
2023,0    1
1731,0    1
1724,0    1
1714,0    1
1504,0    1
1270,0    1
1273,0    1
1306,0    1
1364,0    1
1368,0    1
1379,0    1
1427,0    1
1433,0    1
1434,0    1
1458,0    1
1481,0    1
1482,0    1
1494,0    1
1515,0    1
1697,0    1
1525,0    1
1542,0    1
1558,0    1
1564,0    1
1577,0    1
1581,0    1
1591,0    1
1601,0    1
1602,0    1
1624,0    1
1669,0    1
1673,0    1
1678,0    1
556,0     1
518,0     1
514,0     1
508,0     1
2048,0    1
2055,0    1
2060,0    1
2061,0    1
2064,0    1
39,0      1
51,0      1
95,0      1
169,0     1
224,0     1
242,0     1
286,0     1
340,0     1
431,0     1
496,0     1
511,0     1
612,0     1
650,0     1
684,0     1
730,0     1
757,0     1
869,0     1
875,0     1
964,0     1
970,0     1
1006,0    1
1055,0    1
1061,0    1
1107,0    1
2038,0    1
2027,0    1
2010,0    1
1873,0    1
1751,0    1
1753,0    1
1787,0    1
1801,0    1
1813,0    1
1814,0    1
1833,0    1
1834,0    1
1835,0    1
1837,0    1
1844,0    1
1856,0    1
1858,0    1
1883,0    1
2007,0    1
1886,0    1
1905,0    1
1907,0    1
1908,0    1
1922,0    1
1929,0    1
1948,0    1
1972,0    1
1980,0    1
1982,0    1
1992,0    1
1997,0    1
2003,0    1
1180,0    1
1193,0    1
1226,0    1
342,0     1
144,0     1
155,0     1
167,0     1
200,0     1
201,0     1
211,0     1
214,0     1
243,0     1
271,0     1
282,0     1
309,0     1
323,0     1
334,0     1
364,0     1
137,0     1
367,0     1
392,0     1
397,0     1
407,0     1
445,0     1
468,0     1
471,0     1
473,0     1
477,0     1
479,0     1
485,0     1
487,0     1
494,0     1
139,0     1
113,0     1
1254,0    1
1890,0    1
1321,0    1
1465,0    1
1479,0    1
1551,0    1
1555,0    1
1604,0    1
1757,0    1
1760,0    1
1789,0    1
1807,0    1
1812,0    1
1818,0    1
1830,0    1
1939,0    1
106,0     1
1994,0    1
4,0       1
10,0      1
30,0      1
41,0      1
42,0      1
53,0      1
54,0      1
55,0      1
64,0      1
70,0      1
84,0      1
97,0      1
1998,0    1
1349,0    1
1981,0    1
1790,0    1
1423,0    1
1459,0    1
1472,0    1
1485,0    1
1543,0    1
1547,0    1
1553,0    1
1562,0    1
1582,0    1
1606,0    1
1658,0    1
1665,0    1
1737,0    1
1823,0    1
1346,0    1
1857,0    1
1864,0    1
1881,0    1
1888,0    1
1950,0    1
1962,0    1
1975,0    1
1986,0    1
2000,0    1
2,0       1
5,0       1
35,0      1
76,0      1
1356,0    1
1334,0    1
1969,0    1
772,0     1
291,0     1
292,0     1
306,0     1
335,0     1
420,0     1
421,0     1
441,0     1
531,0     1
549,0     1
567,0     1
581,0     1
702,0     1
716,0     1
836,0     1
1324,0    1
840,0     1
844,0     1
867,0     1
889,0     1
924,0     1
976,0     1
992,0     1
1002,0    1
1073,0    1
1138,0    1
1192,0    1
1196,0    1
1315,0    1
98,0      1
120,0     1
147,0     1
1283,0    1
1119,0    1
1126,0    1
1128,0    1
1177,0    1
1182,0    1
1201,0    1
1218,0    1
1220,0    1
1224,0    1
1235,0    1
1237,0    1
1255,0    1
1264,0    1
1293,0    1
154,0     1
1295,0    1
1322,0    1
1344,0    1
1355,0    1
1362,0    1
1369,0    1
1377,0    1
1402,0    1
1408,0    1
1417,0    1
1421,0    1
1422,0    1
1424,0    1
1106,0    1
1101,0    1
1100,0    1
1097,0    1
159,0     1
160,0     1
163,0     1
176,0     1
177,0     1
195,0     1
202,0     1
205,0     1
252,0     1
258,0     1
260,0     1
267,0     1
275,0     1
293,0     1
302,0     1
314,0     1
329,0     1
361,0     1
363,0     1
1013,0    1
1015,0    1
1018,0    1
1034,0    1
1046,0    1
1050,0    1
1074,0    1
1082,0    1
264,0     1
253,0     1
227,0     1
1225,0    1
1527,0    1
1866,0    1
2026,0    1
107,0     1
170,0     1
215,0     1
304,0     1
529,0     1
691,0     1
692,0     1
1005,0    1
1024,0    1
1039,0    1
1375,0    1
1696,0    1
1661,0    1
1668,0    1
1698,0    1
1937,0    1
2017,0    1
117,0     1
131,0     1
153,0     1
899,0     1
1014,0    1
1117,0    1
1238,0    1
1277,0    1
436,0     1
391,0     1
158,0     1
145,0     1
319,0     1
1900,0    1
81,0      1
387,0     1
999,0     1
1035,0    1
58,0      1
558,0     1
825,0     1
1712,0    1
73,0      1
820,0     1
1294,0    1
1774,0    1
1815,0    1
1993,0    1
32,0      1
100,0     1
244,0     1
327,0     1
373,0     1
729,0     1
830,0     1
981,0     1
1042,0    1
1080,0    1
1995,0    1
1666,0    1
1805,0    1
207,0     1
1596,0    1
1278,0    1
1288,0    1
1307,0    1
1336,0    1
1352,0    1
1360,0    1
1419,0    1
1478,0    1
1480,0    1
1489,0    1
1520,0    1
1535,0    1
1586,0    1
1667,0    1
1932,0    1
1701,0    1
1706,0    1
1971,0    1
1976,0    1
1985,0    1
2032,0    1
2056,0    1
57,0      1
78,0      1
104,0     1
118,0     1
121,0     1
125,0     1
1267,0    1
1252,0    1
1184,0    1
1167,0    1
2016,0    1
20,0      1
184,0     1
206,0     1
228,0     1
239,0     1
256,0     1
339,0     1
406,0     1
429,0     1
444,0     1
452,0     1
456,0     1
481,0     1
513,0     1
597,0     1
600,0     1
630,0     1
638,0     1
683,0     1
780,0     1
817,0     1
901,0     1
944,0     1
984,0     1
1088,0    1
1124,0    1
1457,0    1
1460,0    1
1484,0    1
230,0     1
27,0      1
46,0      1
52,0      1
68,0      1
79,0      1
80,0      1
91,0      1
119,0     1
126,0     1
148,0     1
150,0     1
198,0     1
216,0     1
270,0     1
579,0     1
277,0     1
299,0     1
315,0     1
330,0     1
369,0     1
386,0     1
390,0     1
412,0     1
422,0     1
434,0     1
450,0     1
469,0     1
491,0     1
1949,0    1
1941,0    1
1924,0    1
1909,0    1
1280,0    1
1309,0    1
1374,0    1
1390,0    1
1395,0    1
1397,0    1
1409,0    1
1425,0    1
1435,0    1
1445,0    1
1469,0    1
1503,0    1
1534,0    1
1546,0    1
1548,0    1
1598,0    1
1599,0    1
1609,0    1
1638,0    1
1640,0    1
1664,0    1
1684,0    1
1704,0    1
1736,0    1
1782,0    1
1826,0    1
1850,0    1
554,0     1
592,0     1
1202,0    1
1646,0    1
1407,0    1
1420,0    1
1431,0    1
1446,0    1
1477,0    1
1487,0    1
1499,0    1
1533,0    1
1545,0    1
1554,0    1
1563,0    1
1622,0    1
1631,0    1
1659,0    1
599,0     1
1689,0    1
1700,0    1
1739,0    1
1768,0    1
1772,0    1
1792,0    1
1800,0    1
1822,0    1
1854,0    1
1882,0    1
1885,0    1
1931,0    1
1945,0    1
1401,0    1
1387,0    1
259,0     1
1338,0    1
641,0     1
655,0     1
667,0     1
758,0     1
760,0     1
791,0     1
796,0     1
799,0     1
815,0     1
827,0     1
865,0     1
894,0     1
983,0     1
996,0     1
1011,0    1
1019,0    1
1032,0    1
1045,0    1
1049,0    1
1068,0    1
1136,0    1
1179,0    1
1188,0    1
1211,0    1
1228,0    1
1231,0    1
1259,0    1
1245,0    1
1200,0    1
1497,0    1
942,0     1
2062,0    1
28,0      1
62,0      1
199,0     1
343,0     1
351,0     1
428,0     1
464,0     1
731,0     1
764,0     1
851,0     1
903,0     1
905,0     1
1026,0    1
15,0      1
1085,0    1
1109,0    1
1118,0    1
1152,0    1
1350,0    1
1514,0    1
1523,0    1
1539,0    1
1588,0    1
1617,0    1
1719,0    1
1870,0    1
2031,0    1
2035,0    1
2034,0    1
2014,0    1
2009,0    1
1522,0    1
1544,0    1
1572,0    1
1608,0    1
1611,0    1
1612,0    1
1615,0    1
1619,0    1
1635,0    1
1642,0    1
1653,0    1
1691,0    1
1693,0    1
1703,0    1
1727,0    1
1728,0    1
1745,0    1
1754,0    1
1756,0    1
1764,0    1
1934,0    1
1951,0    1
1952,0    1
1965,0    1
1967,0    1
1979,0    1
2008,0    1
2065,0    1
60,0      1
1171,0    1
548,0     1
283,0     1
308,0     1
325,0     1
355,0     1
378,0     1
449,0     1
466,0     1
486,0     1
492,0     1
505,0     1
510,0     1
527,0     1
547,0     1
577,0     1
85,0      1
679,0     1
785,0     1
861,0     1
864,0     1
878,0     1
895,0     1
900,0     1
936,0     1
997,0     1
1048,0    1
1071,0    1
1116,0    1
1132,0    1
262,0     1
240,0     1
231,0     1
226,0     1
346,0     1
384,0     1
498,0     1
551,0     1
604,0     1
626,0     1
644,0     1
649,0     1
714,0     1
781,0     1
804,0     1
856,0     1
998,0     1
1120,0    1
1143,0    1
1251,0    1
1438,0    1
1574,0    1
1671,0    1
94,0      1
112,0     1
129,0     1
142,0     1
161,0     1
164,0     1
190,0     1
194,0     1
2040,0    1
Name: employee_number, dtype: int64

In [ ]:
df["employee_number"].value_counts()
df[["attrition","employee_number"]].sort_values(by="employee_number")

In [ ]:
df["employee_number"]==424

In [85]:
df[df["employee_number"]=="424,0"]

,age,attrition,business_travel,daily_rate,department,distance_from_home,education,education_field,employee_number,environment_satisfaction,gender,hourly_rate,job_involvement,job_level,job_role,job_satisfaction,marital_status,monthly_income,monthly_rate,num_companies_worked,over_18,overtime,percent_salary_hike,performance_rating,relationship_satisfaction,standard_hours,stock_option_level,total_working_years,training_times_last_year,work_life_balance,years_at_company,years_in_current_role,years_since_last_promotion,years_with_curr_manager,same_as_monthly_income,date_birth,salary,role_departament,number_children,remote_work
872,31,No,travel_rarely,106.0,desconocido,2,3,human_resources,"424,0",1,0,62,2,2,hUmAN rESOuRCEs,1,NaN,"6410,0",17822,3,Y,No,12,"3,0",4,NaN,0,NaN,1,"3,0",2,NaN,1,0,"6410,0",1992,1000000000$,NaN,NaN,False
1513,31,No,travel_rarely,106.0,desconocido,2,3,human_resources,"424,0",1,0,62,2,2,hUMan rEsOuRCES,1,NaN,"6410,0",17822,3,Y,No,12,"3,0",4,NaN,0,NaN,1,"3,0",2,NaN,1,0,"6410,0",1992,1000000000$,NaN,NaN,True

In [91]:
df.duplicated().index #filas que tienen duplicados

Int64Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
            ...
            1604, 1605, 1606, 1607, 1608, 1609, 1610, 1611, 1612, 1613],
           dtype='int64', length=1614)